recipes/chickpea-curry.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chickpea Curry</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Chickpea Curry</h1>
<p>
<a href="https://www.avantgardevegan.com/recipes/chickpea-curry/">Original link</a>
</p>

<div id="outline-container-org6b7b543" class="outline-2">
<h2 id="org6b7b543">Ingredients</h2>
<div class="outline-text-2" id="text-org6b7b543">
</div>
<div id="outline-container-org722c246" class="outline-3">
<h3 id="org722c246">Curry</h3>
<div class="outline-text-3" id="text-org722c246">
<ul class="org-ul">
<li>1 Onion, chopped small</li>
<li>3 cloves Garlic, minced</li>
<li>1 Hot Red Chilli, chopped fine</li>
<li>Thumb sized piece Ginger, minced</li>
<li>3 tsp Sea Salt</li>
<li>1 tsp Ground Turmeric</li>
<li>1 tsp Mustard Seeds</li>
<li>1 tsp Ground Coriander</li>
<li>1 tsp Ground Cumin</li>
<li>4 Curry Leaves</li>
<li>1 tsp Ground Fenugreek</li>
<li>2 tbs Tomato Puree</li>
<li>2 cans Chickpeas, drained</li>
<li>1 can Coconut Milk</li>
<li>1 tbs Coconut Flour</li>
</ul>
</div>
</div>

<div id="outline-container-org8588399" class="outline-3">
<h3 id="org8588399">Rice</h3>
<div class="outline-text-3" id="text-org8588399">
<ul class="org-ul">
<li>1 cup/200g Basmati Rice</li>
<li>2 cups/480ml Water</li>
<li>1/2 tsp Ground Turmeric</li>
<li>1 stick Cinnamon</li>
</ul>
</div>
</div>

<div id="outline-container-org7d4c114" class="outline-3">
<h3 id="org7d4c114">Garnish</h3>
<div class="outline-text-3" id="text-org7d4c114">
<ul class="org-ul">
<li>Fresh Coriander</li>
<li>1 tbs Black Onion Seeds</li>
<li>Mango Chutney</li>
<li>Poppadoms</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcbc0cdc" class="outline-2">
<h2 id="orgcbc0cdc">Method</h2>
<div class="outline-text-2" id="text-orgcbc0cdc">
<ol class="org-ol">
<li>Place a large saucepan over a medium heat and add the oil. When the pan is hot add the onion, garlic, chilli &amp; ginger, cook for 10 minutes – stirring often. This is the most important part of making the curry, getting your base ingredients lovely and golden will insure the finished curry has a powerful flavour.</li>
<li>Add the all the spices &amp; cook whilst stirring for another 3-4 minutes to let the spices roast &amp; release their aromatics. Throw in the tomato puree and cook for 1 more minute before adding the chickpeas &amp; stir well so they are coated in all the beautiful flavours.</li>
<li>Deglaze the pan with the coconut milk and stir well then allow it to come to a simmer.</li>
<li>Let your curry bubble away gently for around 12 minutes.</li>
<li>Meanwhile, add the rinsed rice, water, turmeric &amp; cinnamon stick to a small saucepan, pop the lid on and place the pan over a low heat to cook gently for around 12 minutes or until the liquid has been absorbed by the rice and it’s perfectly cooked.</li>
<li>When the rice is cooked, just before serving stir the coconut flour into the curry to thicken it up.</li>
<li>Serve up your curry with the rice, chutney, side salad, a sprinkle of black onion seeds and poppadoms.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
